:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
:: 本脚本仅适用于在前台构建机上运行，如有疑问请联系teppei
:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
@echo off

title xml2json启动器@teppei

echo ===============================
echo ======转手游配置json启动脚本======
echo ===============================

set hudson_xml2jsonToolPath=E:\FYM_xml2json

E:
cd %hudson_xml2jsonToolPath%

:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

REM 解析传入的参数，主线还是分支
set hudson_xml2jsonVer=%1

:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

REM 调用构建脚本
call %hudson_xml2jsonToolPath%\xml2json_launcher.bat %hudson_xml2jsonVer%

echo 构建结束，请检查构建日志