:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
:: 本脚本仅适用于在前台构建机上运行，如有疑问请联系teppei
:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
@echo off

title 构建协议启动器@teppei

echo ==============================
echo ======转手游协议结构启动脚本======
echo ==============================

set hudson_convertToolPath=E:\FYM_Protocol

E:
cd %hudson_convertToolPath%

:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

REM 解析传入的参数，主线还是分支
set hudson_convertVer=%1

:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

REM 调用构建脚本
call %hudson_convertToolPath%\convert.bat %hudson_convertVer%

echo 构建结束，请检查构建日志